In [1]:
import pandas as pd

### Creating csv file

In [5]:
frnds ={"Name":["F1","F2","F3"],
        "Age":[20,21,22],
        "City":["C1","C2","C3"]}
df = pd.DataFrame(frnds)
df

  Name  Age City
0   F1   20   C1
1   F2   21   C2
2   F3   22   C3

In [8]:
df.to_csv("Friends.csv",index=False)

In [9]:
df2 = pd.read_csv("Friends.csv")
df2

  Name  Age City
0   F1   20   C1
1   F2   21   C2
2   F3   22   C3

### Reading csv from internet

In [12]:
import pandas as pd

# Define column names from UCI Auto MPG dataset
column_names = [
    "mpg", "cylinders", "displacement", "horsepower", "weight",
    "acceleration", "model_year", "origin", "car_name"
]

# URL of Auto MPG dataset
url = "https://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data"

# Load dataset
df = pd.read_csv(
    url,
    sep='\s+',   # data separated by spaces
    names=column_names,      # assign column names
    na_values="?"            # missing values marked as '?'
)

# Save to local CSV file
df.to_csv("auto_mpg.csv", index=False)

print("✅ Auto MPG dataset saved as 'auto_mpg.csv'")
print(df.head())

✅ Auto MPG dataset saved as 'auto_mpg.csv'
    mpg  cylinders  displacement  horsepower  weight  acceleration  \
0  18.0          8         307.0       130.0  3504.0          12.0
1  15.0          8         350.0       165.0  3693.0          11.5
2  18.0          8         318.0       150.0  3436.0          11.0
3  16.0          8         304.0       150.0  3433.0          12.0
4  17.0          8         302.0       140.0  3449.0          10.5

   model_year  origin                   car_name
0          70       1  chevrolet chevelle malibu
1          70       1          buick skylark 320
2          70       1         plymouth satellite
3          70       1              amc rebel sst
4          70       1                ford torino

In [21]:
url = "https://support.staffbase.com/hc/en-us/article_attachments/360009197031/username.csv"
df3 = pd.read_csv(url,encoding="latin",sep=" ")
df3.head()

                      Username;  Identifier;First  name;Last  name
0   booker12;9012;Rachel;Booker               NaN        NaN   NaN
1        grey07;2070;Laura;Grey               NaN        NaN   NaN
2  johnson81;4081;Craig;Johnson               NaN        NaN   NaN
3   jenkins46;9346;Mary;Jenkins               NaN        NaN   NaN
4      smith79;5079;Jamie;Smith               NaN        NaN   NaN